# encoding: utf-8

module FarsiFu
  PERSIAN_CHARS = "۱۲۳۴۵۶۷۸۹۰،؛"
  ENGLISH_CHARS = "1234567890,;"

  PERSIAN_DIGIT_JOINT = " و "
  PERSIAN_DIGIT_SIGN = ["منفی ", "مثبت ", " ممیز "]

  PERSIAN_DIGIT_SPELL = {
    0          => [ nil ,"یک","دو","سه","چهار","پنج","شش","هفت","هشت","نه", "صفر"] ,
    1          => [ nil ,"ده","بیست","سی","چهل","پنجاه","شصت","هفتاد","هشتاد","نود"],
    2          => [ nil ,"صد","دویست","سیصد","چهارصد","پانصد","ششصد","هفتصد","هشتصد","نهصد"],
    "10..19"   => [ "ده" ,"یازده","دوازده","سیزده","چهارده","پانزده","شانزده","هفده","هجده","نوزده"],
    "zillion"  => [ nil ,"هزار","میلیون","میلیارد","بیلیون","تریلیون","کوادریلیون","کوینتیلیون","سیکستیلیون","سپتیلیون","اکتیلیون","نونیلیون","دسیلیون"],
    "decimals" => [ nil, "دهم", "صدم", "هزارم", "ده‌هزارم", "صدهزارم", "میلیونیم", "ده‌میلیونیم","صدمیلیونیم","میلیاردیم"]
  }
end